"Be careful the environment you choose for it will shape you; be careful the friends you choose for you will become like them."
"Effective leadership is putting first things first. Effective management is discipline, carrying it out."
"If you care enough for a result, you will most certainly attain it."
"If you want a quality, act as if you already had it."
"No matter how carefully you plan your goals they will never be more that pipe dreams unless you pursue them with gusto."
"A leader is best when people barely know he exists, when his work is done, his aim fulfilled, they will say: we did it ourselves."
"To grasp and hold a vision, that is the very essence of successful leadership - not only on the movie set where I learned it, but everywhere."
"To lead the people, walk behind them."
"No person will make a great business who wants to do it all himself or get all the credit."
"Don't be afraid to give up the good to go for the great."
"Every silver lining has a cloud."
"He who is prudent and lies in wait for an enemy who is not, will be victorious."
"Leadership is the art of getting someone else to do something you want done because he wants to do it."
"The cautious seldom err."
"The speed of the leader is the speed of the gang."
"What you do speaks so loudly that I cannot hear what you say."
"You don't lead by hitting people over the head-that's assault, not leadership."
"No man will make a great leader who wants to do it all himself, or to get all the credit for doing it"
"Those who seek power are not worthy of that power."
"When I lend I am a friend, when I ask I am a foe."
"The first man gets the oyster, the second man gets the shell."
"A real leader faces the music, even when he doesn't like the tune."
"Love and respect do not automatically accompany a position of leadership. They must be earned."
"Everyone who's ever taken a shower has an idea. It's the person who gets out of the shower, dries off and does something about it who makes a difference."
"Our business in life is not to get ahead of others, but to get ahead of ourselves."
"People who don't take risks generally make about two big mistakes a year. People who do take risks generally make about two big mistakes a year."
"The amount of good luck coming your way depends on your willingness to act."
"To succeed, one must be creative and persistent."
"You have to have your heart in the business and the business in your heart."
"Your most dangerous competitors are those that are most like you."
"Leadership is an opportunity to serve. It is not a trumpet call to self-importance."
"None of the world's problems will have a solution until the world's individuals become thoroughly self-educated."
"He presented his views to the leadership, ... He went before the Judiciary Committee ... he answered every question to the satisfaction of each of the members."
"You don't have to hold a position in order to be a leader."
"A leader is not an administrator who loves to run others, but someone who carries water for his people so that they can get on with their jobs"
"Leadership development is not an event."
"She's done that time and again and we really needed her leadership in the second half. That's why she's a great player."
"It's a new leadership style. You do a lot more listening than talking."
"Accountability at every level is critical, and leadership begins at the top."
"Leadership is liberating people to do what is required of them in the most effective and humane way possible."
"Leadership should be born out of the understanding of the needs of those who would be affected by it."
"You learn far more from negative leadership than from positive leadership. Because you learn how not to do it. And, therefore, you learn how to do it."
"The problem is not money. The problem is priorities and leadership."
"Teamwork is no accident.It is the by-product of good leadership."
"The growth and development of people is the highest calling of leadership."
"I forgot to shake hands and be friendly. It was an important lesson about leadership."
"Leadership involves finding a parade and getting in front of it."
"If one branch doesn't move, the many branches won't stir. T: 'If someone does not lead, no one will follow.'"
"Coaching helps you develop your leadership skills, clarify your values and guiding principles and build your reputation."
"It would have been nice to have some discussion with the leadership,"
"We have good senior leadership. It's good to see them playing together and playing well."
"If you cannot serve, you cannot rule"
"Popularity is not leadership."
"There go my people. I must find out where they are going so I can lead them."
"The leadership instinct you are born with is the backbone. You develop the funny bone and the wishbone that go with it."
"What you cannot enforce, do not command."
"Leadership is getting someone to do what they don't want to do, to achieve what they want to achieve."
"Leadership cannot really be taught. It can only be learned."
"The true leader is always led"
"If you think you're leading and no one is following you, then you're only taking a walk."
"Management is about arranging and telling. Leadership is about nurturing and enhancing."
"Unless you define who does what chaos is imminent."
"The final test of a leader is that he leaves behind him in other men the conviction and the will to carry on."
"The very essence of leadership is that you have to have vision. You can't blow an uncertain trumpet."
"I suppose leadership at one time meant muscles; but today it means getting along with people"
"This is an Eagle project for one of the Scouts, ... The goal is to show leadership and also it has got to benefit the community."
"Our leadership and our veterans kept us in the game, but once our two young players settled down, they played with so much confidence."
"Every man in a leadership position must know when it's time to hand over the reins,"
"He inspires players to go above their abilities. We play off his leadership."
"The first responsibility of a leader is to define reality. The last is to say thank you. In between, the leader is a servant."
"There are a lot of people in leadership just because they were the first in."
"Perhaps the most central characteristic of authentic leadership is the relinquishing of the impulse to dominate others."
"It's pretty easy to criticize leadership."
"Leadership is accountable to results."
"He has shown, basically in my mind, the signs of leadership."
"Leadership has a harder job to do than just choose sides. It must bring sides together."
"yet another reminder that the governor has failed to provide leadership in Sacramento and work with the Legislature to get things done."
"Management works in the system; Leadership works on the system."
"Leadership requires talking about the right things and doing the right things, and sometimes you take your knocks when you do that."
"Their leadership wouldn't settle for one year. We offered to settle, but they wanted a two-year contract."
"Leadership in today's world requires far more than a large stock of gunboats and a hard fist at the conference table."
"Every man in leadership positions must know when it's time to hand over the reins to someone else,"
"Leadership does not depend on being right."
"Whatever way I can be a part of the team, whether it's with morale, leadership or helping guys behind the scenes, then I'm going to do that."
"A veteran can provide leadership not only on the field but in the clubhouse. They're really invaluable."
"We have to continue to push, not get down on ourselves and find that leadership."
"No one is the same player at 31 that they were at 26. But you never lose that leadership. It gets better as you mature because you have seen so many things."
"I was a good manager, ... In the last three years I started to become an instructional leader. Leadership is not a dictatorship; it needs to be collaborative."
"A leader is the wave pushed ahead by the ship."
"You cannot be a leader, and ask other people to follow you, unless you know how to follow, too."
"Leadership must be established from the top down."
"Don't necessarily avoid sharp edges. Occasionally they are necessary to leadership."
"There was a lot of good leadership on the court. It made a huge difference. Those seniors never stopped talking."
"Ninety percent of leadership is the ability to communicate something people want."
"A Leader is someone who can do everything him(her)self, but let's other people help him(her)."
"The potential is very good. I am impressed with the leadership on and off the floor. It is easy to let little mistakes domino but we didn't let it happen."
"The height of ability in the least able consists in knowing how to submit to the good leadership of others."
"Great leaders have a heart for people. They take time for people. They view people as the bottom line, not as a tool to get to the bottom line."
"There are a lot of people who are hungry for real leadership."
"A man who wants to lead the orchestra must turn his back on the crowd."