"A pair of powerful spectacles has sometimes sufficed to cure a person in love."
"Affection is responsible for nine-tenths of whatever solid and durable happiness there is in our lives."
"As soon go kindle fire with snow, as seek to quench the fire of love with words."
"First love is only a little foolishness and a lot of curiosity."
"Friendship often ends in love; but love in friendship - never."
"I like not only to be loved, but also to be told I am loved."
"Life is the flower for which love is the honey."
"Love consists in this, that two solitudes protect and touch and greet each other."
"Love is a gross exaggeration of the difference between one person and everybody else."
"Love is a smoke made with the fume of sighs."
"Love is an irresistible desire to be irresistibly desired."
"The greatest happiness of life is the conviction that we are loved; loved for ourselves, or rather, loved in spite of ourselves."
"The only abnormality is the incapacity to love."
"To fear love is to fear life, and those who fear life are already three parts dead."
"To say 'I love you' one must first be able to say the 'I'."
"We are all born for love. It is the principle of existence, and its only end."
"We loved with a love that was more than love."
"Who so loves believes the impossible."
"Who, being loved, is poor?"
"How do I love thee? Let me count the ways. I love thee to the depth and breadth and height my soul can reach."
"Love looks not with the eyes, but with the mind; and therefore is winged Cupid painted blind."
"Gravitation can not be held responsible for people falling in love"
"Love is the wisdom of the fool and the folly of the wise."
"If it is true that there are as many minds as there are heads, then there are as many kinds of love as there are hearts."
"Where we love is home, home that our feet may leave, but not our hearts."
"I always felt insecure and in the way — but most of all I felt scared. I guess I wanted love more than anything else in the world."
"Women are made to be loved, not understood."
"To get the full value of joy you must have someone to divide it with."
"Love is a wonderful, terrible thing"
"Love is like a virus. It can happen to anybody at any time."
"To love is so startling it leaves little time for anything else."
"A wise girl kisses but doesn't love, listens but doesnt believe, and leaves before she is left."
"Live the life you've dreamed"
"There is no remedy for love but to love more."
"She's gone. I am abused, and my relief must be to loathe her."
"These two imparadised in one another's arms, the happier Eden, shall enjoy their fill of bliss on bliss."
"This as it will be seen is other far / Than with brooks taken otherwhere in song. / We love the things we love for what they are."
"When love begins to sicken and decay it uses an enforced ceremony. [Julius Caesar]"
"People everywhere love Windows."
"The more I give to thee, the more I have, for both are infinite."
"Familiar acts are beautiful through love."
"Give a little to love a child, and you get a great deal back"
"All Love is sweet. Given or returned. Common as light is love, And its familiar voice wearies not ever."
"Something there is that doesn't love a wall"
"Earth's the right place for love; / I don't know where it's likely to go better."
"No lover ever studied every whim of his mistress as I did those of President Roosevelt."
"Gravitation is not responsible for people falling in love."
"So dear I love him that with him, All deaths I could endure. Without him, live no life."
"The hottest love has the coldest end."
"All mankind love a lover."
"At the touch of love everyone becomes a poet."
"Friendship is Love without his wings!"
"Let us always meet each other with smile, for the smile is the beginning of love."
"Love conquers all."
"Love is a canvas furnished by nature and embroidered by imagination."
"Love is composed of a single soul inhabiting two bodies."
"Love is the flower you've got to let grow."
"Love is the joy of the good, the wonder of the wise, the amazement of the Gods."
"Take away love and our earth is a tomb."
"The hunger for love is much more difficult to remove than the hunger for bread."
"Oh, 'tis love, 'tis love that makes the world go round"
"Gravitation is not responsible for people falling in love."
"In this life we cannot do great things. We can only do small things with great love"
"The more I think about it,the more I realize there is nothing more artistic than to love others"
"A low self-love in the parent desires that his child should repeat his character and fortune."
"Grow old along with me the best is yet to be."
"Love in a hut, with water and a crust, / Is - Love forgive us! - cinders, ashes, dust."
"But I always think that the best way to know God is to love many things."
"Unless you love someone, nothing else makes any sense."
"Love is a promise, love is a souvenir, once given never forgotten, never let it disappear."
"Thou art to me a delicious torment."
"Never self-possessed, or prudent, love is all abandonment."
"I love you the more in that I believe you had liked me for my own sake and for nothing else."
"In her first passion, a woman loves her lover, in all the others all she loves is love"
"Wicked men obey from fear; good men, from love."
"A rose by any other name would smell as sweet"
"Oh to love so, be so loved, yet so mistaken!"
"All mankind loves a lover."
"All You Need Is Love"
"Can there be a love which does not make demands on its object?"
"Love is you; you and me."
"Philosopher: A lover of wisdom, which is to say, Truth"
"I feel that success is not determined by one or two players, but by an entire team. Everyone is important in determining success."
"The hardest thing to do is watch the one you love, love someone else."
"Passion makes the world go round. Love just makes it a safer place."
"The only love affair I have ever had was with music."
"All love shifts and changes. I don't know if you can be wholeheartedly in love all the time."
"'Tis better to have loved and lost than never to have loved at all."
"When love is not madness, it is not love."
"The most precious possession that ever comes to a man in this world is a woman's heart."
"He is more myself than I am. Whatever our two souls are made of, his and mine are the same."
"We are not the same persons this year as last; nor are those we love. It is a happy chance if we, changing, continue to love a changed person."
"Love is the ultimate outlaw. It just won't adhere to any rules. The most any of us can do is sign on as its accomplice."
"Love is that condition in which the happiness of another person is essential to your own."
"Love doesnt make the world go round. Love is what makes the ride worthwhile."
"I loved you when love was Spring, and May, Loved you when summer deepened into June, and now when autumn yellows all the leaves..."
"After a few years of marriage a man can look right at a woman without seeing her and a woman can see right through a man without looking at him."
"Love begins at home, and it is not how much we do... but how much love we put in that action."
"Ever has it been that love knows not its own depth until the hour of separation."
"The way to love anything is to realize that it might be lost."