"It always seems impossible until its done."
"Good, better, best. Never let it rest."
"In order to succeed, we must first believe that we can."
"Failure will never overtake me if my determination to succeed is strong enough."
"Life is 10% what happens to you and 90% how you react to it."
"Start where you are. Use what you have. Do what you can."
"It does not matter how slowly you go as long as you do not stop."
"Our greatest weakness lies in giving up."
"You can't cross the sea merely by standing and staring at the water."
"Don't watch the clock; do what it does - Keep going."
"Don't wait for it to happen. Make it happen."
"If you can dream it, you can do it."
"The way to get started is to quit talking and begin doing."
"If you can’t stop thinking about it, don’t stop working for it."
"Pearls don’t lie on the seashore. If you want one, you must dive for it."
"Believe you can and you're halfway there."
"Change your thoughts and you change your world."
"Look within. Within is the fountain of good, and it will ever bubble up, if thou wilt ever dig."
"What great thing would you attempt if you knew you could not fail?"
"Edison failed 10, 000 times before he made the electric light. Do not be discouraged if you fail a few times."
"Success is never final. Failure is never fatal. It is courage that counts."
"Love and desire are the spirit's wings to great deeds."
"Believe you can and you're halfway there."
"Change your thoughts and you change your world."
"What great thing would you attempt if you knew you could not fail?"
"Success is never final. Failure is never fatal. It is courage that counts."
"If you find yourself in a hole, the first thing to do is stop digging."
"Out of clutter, find Simplicity. From discord, find Harmony. In the middle of difficulty lies Opportunity."
"Look within. Within is the fountain of good, and it will ever bubble up, if thou wilt ever dig."
"The glow of one warm thought is to me worth more than money."
"Work is 1% inspiration plus 99% transpiration"
"A compliment is something like a kiss through a veil."
"Belief creates the actual fact."
"Don't judge each day by the harvest you reap but by the seeds that you plant."
"Judge each day not by the harvest you reap but by the seeds you plant."
"The best way out is always through."
"We can't help everyone, but everyone can help someone."
"We convince by our presence."
"With self-discipline most anything is possible."
"Whenever you find yourself on the side of the majority, it is time to pause and reflect."
"He who is devoid of the power to forgive is devoid of the power to love."
"Help us to be thankful for this day and every day and treat each one as a preciousgem to be filled to the full with meaning and with love."
"Young people need models, not critics"
"Music in the soul can be heard by the universe."
"Common sense is instinct. Enough of it is genius."
"A great many people think they are thinking when they are rearranging theirprejudices."
"There's no scarcity of opportunity to make a living at what you love. There isonly a scarcity of resolve to make it happen."
"The person who sends out positive thoughts activates the world around him positively and draws back to himself positive results."
"Inspiration exists, but it has to find us working."
"To think clearly without hurry or confusion; To love everybody sincerely; To act in everything with the highest motives; To trust God unhesitatingly."
"You were not born a winner, and you were not born a loser. You are what you make yourself be."
"What I cannot love, I overlook"
"As we are liberated from our own fear, our presence automatically liberates others."
"I want to continue my growth in every way."
"It is literally true that you can succeed best and quickest by helping others to succeed."
"At some point in your life, if you're lucky, you throw practicality to the wind and start living."
"Eighty percent of success is showing up."
"Obstacles cannot crush me. Every obstacle yields to stern resolve. He who is fixed to a star does not change his mind."
"Only through focus can you do world-class things, no matter how capable you are."
"As every divided kingdom falls, so every mind divided between many studies confounds and saps itself."
"Face your deficiencies and acknowledge them; but do not let them master you. Let them teach you patience, sweetness, insight."
"The state of your life is nothing more than a reflection of your state of mind."
"And as we let our own light shine, we unconsciously give other people permission to do the same."
"Men must live and create. Live to the point of tears."
"It is common sense to take a method and try it. If it fails, admit it frankly and try another, but above all try something."
"Happiness resides not in possessions, and not in gold, happiness dwells in the soul."
"Hope is a waking dream."
"Thinking: the talking of the soul with itself."
"What lies behind us and what lies before us are tiny matters compared to what lies within us."
"Do not go where the path may lead, go instead where there is no path and leave a trail."
"Worry not that no one knows of you; seek to be worth knowing."
"People only see what they are prepared to see."
"The longer we dwell on our misfortunes, the greater is their power to harm us."
"Be vigilant; guard your mind against negative thoughts."
"Remember that not getting what you want is sometimes a wonderful stroke of luck."
"What you do speaks so loudly that I cannot hear what you say."
"Know how to listen, and you will profit even from those who talk badly."
"By necessity, by proclivity, and by delight, we all quote."
"We do not yet trust the unknown power of thoughts"
"One never notices what has been done; one can only see what remains to be done."
"Don't bother just to be better than your contemporaries or predecessors. Try to be better than yourself."
"She soars on her own wings."
"If we did the things we are capable of, we would astound ourselves."
"Our lives are the only meaningful expression of what we believe and in Whom we believe. And the only real wealth, for any of us, lies in our faith."
"To dream of the person you would like to be is to waste the person you are."
"Leaders are readers, so lead oneself to read!"
"The real measure of your wealth is how much you'd be worth if you lost all your money."
"I can't think of better inspiration. It's right there. You're looking at it this is what you work for. There's nothing else that needs to be said or heard."
"How glorious a greeting the sun gives the mountains!"
"Nothing makes one feel so strong as a call for help."
"Tears are often the telescope by which men see far into heaven."
"There is nothing stronger in the world than gentleness."
"Seek first to understand, then to be understood."
"Life is 10% of what happens to me and 90% of how I react to it."
"Love is the ultimate outlaw. It just won't adhere to any rules. The most any of us can do is sign on as its accomplice."
"You are what you think. You are what you go for. You are what you do!"
"Wrong is wrong, no matter who does it or who says it."
"Do not judge, and you will never be mistaken"
"Friends are those rare people who ask how we are and then wait to hear the answer."
"The way I see it, if you want the rainbow, you gotta put up with the rain."